song-of-my-city/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Song of My City Screening</title>
<meta name="author" content="Jay Dixit" />
<meta name="description" content="Join us for an intimate screening to celebrate John's Telluride selection." />
<meta name="keywords" content="movie night, Song of My City, screening, short film" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto+Slab">
<link rel="stylesheet" href="css/base.css">
<link rel="stylesheet" href="css/style.css">
<meta property="og:title" content="Song of My City Screening" />
<meta property="og:description" content="Join us for an intimate screening to celebrate John's Telluride selection." />
<meta property="og:image" content="https://jaydixit.com/song-of-my-city/og.png"/>
<meta property="og:url" content="song-of-my-city/index.html"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Song of My City Screening</h1>
</header><style>
h1.title {
 display: none;
}
section.module.parallax-1 {
 background-image: url("img/song-of-my-city-1.png");
 min-height: 60vh;
}
section.module.parallax-1 .container {
  text-align: center;
  padding: 0 0 0;
}
section.module.parallax-1 h1 {
  display: block;
  width: 100%;
  margin: 0;
  padding: 0.4em 0.6em;
  text-align: center;
  background: linear-gradient(90deg, rgba(0,0,0,0) 0%, rgba(0,0,0,0.45) 50%, rgba(0,0,0,0) 100%);
  backdrop-filter: blur(4px);
}
section.module.parallax-2 {
 background-image: url("img/song-of-my-city-2.png");
 min-height: 90vh;
}

/* Dynamic parallax section heights */
section.module.parallax {
  min-height: 400px;
  height: auto;
  background-size: cover;
  background-position: center center;
  background-repeat: no-repeat;
  background-attachment: fixed;
}

@media (min-width: 768px) {
  section.module.parallax {
    min-height: 500px;
  }
  section.module.parallax-1 {
    min-height: 90vh;
  }
  section.module.parallax-2 {
    min-height: 120vh;
  }
}

@media (min-width: 1200px) {
  section.module.parallax {
    min-height: 600px;
  }
  section.module.parallax-1 {
    min-height: 110vh;
  }
  section.module.parallax-2 {
    min-height: 140vh;
  }
}

/* Hide footer and remove bottom spacing */
footer {
  display: none;
}

body, html, .wrapper, main {
  margin-bottom: 0 !important;
  padding-bottom: 0 !important;
}

section.module.parallax-2 {
  margin-bottom: 0 !important;
}

/* Smooth scroll-triggered animations */
@keyframes fadeInUp {
  from {
    opacity: 0;
    transform: translateY(30px);
  }
  to {
    opacity: 1;
    transform: translateY(0);
  }
}

section.module.content {
  padding: 80px 24px;
  background: #fff;
  animation: fadeInUp 0.8s ease-out;
}

section.module.content .container {
  max-width: 700px;
  margin: 0 auto;
  padding: 48px;
}

section.module.content h1 {
  font-size: 2.5em;
  margin-bottom: 48px;
  text-align: center;
  font-weight: 300;
  letter-spacing: 0.02em;
}

section.module.content p {
  font-size: 1.2em;
  line-height: 1.75;
  margin-bottom: 24px;
  color: #333;
}

section.module.content .details {
  margin-top: 64px;
  padding: 40px;
  background: linear-gradient(135deg, #fafafa 0%, #f5f5f5 100%);
  border-radius: 12px;
  border: 1px solid #e8e8e8;
  box-shadow: 0 4px 12px rgba(0,0,0,0.06);
  transition: all 0.3s ease;
}

section.module.content .details:hover {
  box-shadow: 0 6px 20px rgba(0,0,0,0.1);
  transform: translateY(-2px);
}

section.module.content .details p {
  margin-bottom: 20px;
  font-size: 1.1em;
  line-height: 1.6;
}

section.module.content .details p:last-child {
  margin-bottom: 0;
}

section.module.content .details strong {
  display: inline-block;
  min-width: 90px;
  font-weight: 600;
  font-size: 1.05em;
  color: #9b4819;
  letter-spacing: 0.3px;
}

section.module.content .details a {
  color: #9b4819;
  text-decoration: none;
  transition: all 0.2s ease;
  border-bottom: 1px solid transparent;
}

section.module.content .details a:hover {
  color: #7a3614;
  border-bottom: 1px solid #9b4819;
}

@media (max-width: 768px) {
  section.module.parallax {
    min-height: 90vh;
    background-size: cover;
    background-position: center top;
    background-attachment: scroll;
    margin-bottom: 0;
  }
  section.module.parallax .container {
    padding: 1em 1em 0;
  }
  section.module.content {
    padding: 64px 16px;
  }

  section.module.content .container {
    padding: 24px;
  }

  section.module.content h1 {
    font-size: 2em;
    margin-bottom: 32px;
  }

  section.module.content p {
    font-size: 1.1em;
    margin-bottom: 16px;
  }

  section.module.content .details {
    padding: 32px;
    margin-top: 48px;
  }

  section.module.content .details p {
    margin-bottom: 16px;
  }

  section.module.content .details strong {
    min-width: 80px;
    font-size: 1.02em;
  }
}
</style>

<div class="wrapper">
<main>

<section class="module parallax parallax-1">
    <div class="container">
    </div>
   </section>

<section class="module content">
 <div class="container">
  <h1>Movie Night: Song of My City</h1>

  <p>Goodside gathers to celebrate our very own John Sears, whose work as editor on this short film earned a spot at Telluride.</p>

  <p><em>Song of My City</em>, directed by David C. Roberts, is a cinematic montage that reconstructs 1970s New York as it exists in the movies that mythologized it&mdash;<em>Taxi Driver</em>, <em>The Warriors</em>, <em>The Taking of Pelham 123</em>. Seventeen minutes of neon, steam, and a skyline that no longer exists.</p>

  <p>Afterwards, we'll screen Ruben Östlund's <em>The Square</em>&mdash;winner of the Palme d'Or at Cannes. A satirical black comedy about a museum curator whose ordered life unravels in increasingly absurd ways.</p>

  <p>Join us. We'll watch, and raise a glass to John's achievement.</p>

  <div class="details">
   <p><strong>Where:</strong> <a href="https://goo.gl/maps/S7hov7YT44mbsjKD8">166 North 7th Street Apt. 3 Brooklyn NY 11211</a></p>
   <p><strong>When:</strong> Thursday December 18, 6:30pm</p>
  </div>

  <div class="details" style="margin-top: 32px;">
   <h2 style="font-size: 1.4em; font-weight: 400; margin-bottom: 24px; text-align: center; color: #333;">Cocktail Menu</h2>

   <p><strong>The Editor's Cut</strong><br/>
   Bourbon, sweet vermouth, Angostura bitters, orange peel</p>

   <p><strong>The Clean Cut</strong> <em>(mocktail)</em><br/>
   Seedlip or non-alcoholic whiskey, black tea, tonic, fresh lime</p>

   <p><strong>The Telluride Toast</strong><br/>
   Gin, lemon juice, simple syrup, lemon peel</p>

   <p><strong>Seventeen Minutes</strong><br/>
   Vodka, lemon juice, simple syrup, soda water, lemon peel</p>

   <p><strong>Neon Steam</strong><br/>
   Bourbon, lemon juice, honey syrup, hot water, lemon wheel</p>
  </div>

 </div>
</section>


   <section class="module parallax parallax-2">
    <div class="container">
    </div>
   </section>

 </main>

 <footer>
  <div class="container">
   <div class="copyright">
    <small>
     <a href="https://jaydixit.com">jaydixit.com</a>
    </small>
   </div>
  </div>
 </footer>

</div><!-- /#wrapper -->
</div>
</body>
</html>
